{
  "welcome": "Welcome to the application",
  "greeting": "Hello, {{name}}!",
  "home": "home",
  "login": "login",
  "main-subtitle": "all aboard for your journey to CS success!",
  "learn-more": "LEARN MORE",
  "stress-free-learning": "stress-free learning",
  "stress-free-learning-contents": "learn without any pressure; through the use of gamification and its incorporation into the lessons, learn while having fun!",
  "12-concepts-to-learn": "12+ concepts to learn",
  "12-concepts-to-learn-contents": "learn anything computer science, with topics ranging from basic programming syntax to iterations and variables.",
  "no-payment-needed": "No payment needed",
  "no-payment-needed-contents": "all of the lessons on NextStop are free; you don’t need to pay to learn, you just need to read!",
  "you-did-it": "you did it!",
  "logout": "logout",

  "unit2_title": "Programming languages (Unit 2)",
  "unit3_title": "Variables and Data Types (Unit 3)",
  "unit4_title": "Operators (Unit 4)",
  "unit5_title": "Conditional Statements and Loops (Unit 5)",

  "unit1_title": "Programmer’s Depot (Unit 1)",
  "unit1_lesson1_title": "1. Introduction",
  "unit1_lesson1_info": "1 minute read · 2 questions",
  "unit1_lesson1_paragraph1": "Hello! Welcome to Nextstop, an engaging new platform for learning about programming and computer science. We keep our lessons short and sweet, with an estimate of 5 minutes of reading time at max.",
  "unit1_lesson1_paragraph2": "As you start your learning with Nextstop, you will be embarking on a train journey to the city of (CITYNAME). Each station your train stops at will introduce you to a new topic, and your train will get closer to the next station every time you complete a lesson. As you progress, you’ll even earn memorable souvenirs from each station!  ",
  "unit1_lesson1_paragraph3": "In each lesson, you’ll see different interactive elements, such as true/false questions…",
  "unit1_lesson1_paragraph4": "And multiple choice questions.",
  "unit1_lesson1_paragraph5": "Besides interactive elements, there will be lots of diagrams to clarify the text.",
  "unit1_lesson1_paragraph6": "Congratulations on finishing your first lesson. We’re excited to see you on board for the rest of your journey—next stop, programming success!",
  "unit1_lesson1_question1": "QUESTION (T/F): Ada Lovelace was the first programmer in the world.",
  "unit1_lesson1_question1_option1": "True",
  "unit1_lesson1_question1_option2": "False",
  "unit1_lesson1_question1_answer": "Good job! This is what you’ll see if you get a true/false question right",
  "unit1_lesson1_question1_wrong_answer": "Not quite. The answer is true. Ada Lovelace discovered that the computer can be used beyond simple calculations! This is what you’ll see if you get a true/false question wrong.",
  "unit1_lesson1_question2": "QUESTION (A/B/C/D): How many developers are there in the world (2024)?",
  "unit1_lesson1_question2_option1": "10.4 million",
  "unit1_lesson1_question2_option2": "16.5 million",
  "unit1_lesson1_question2_option3": "28.7 million",
  "unit1_lesson1_question2_option4": "52.9 million",
  "unit1_lesson1_question2_answer": "Perfect! This is what you’ll see if you get a multiple-choice question right.",
  "unit1_lesson1_question2_wrong_answer": "Close! The answer is C. 28.7 million. As of 2024, there are 28.7 million developers, and the number is still increasing. This is what you’ll see if you get a multiple-choice question wrong.",

  "unit1_lesson2_title": "2. Definition of coding and programming",
  "unit1_lesson2_info": "3-5 min read · 3 questions",
  "unit1_lesson2_paragraph1": "What happens behind the scenes of anything digital — websites, apps, video games, and so much more? It’s all thanks to something called programming. In this lesson, you’ll learn about two recurring key terms of this station: programming and coding.",
  "unit1_lesson2_paragraph2": "First, let’s see how much you already know.",
  "unit1_lesson2_paragraph3": "It’s a common misconception that programming and coding are the same thing. They might sound similar, but they mean different things. Before we dive into the details, consider the difference between construction workers and architects.",
  "unit1_lesson2_paragraph4": "Construction workers follow a given blueprint and place the materials accordingly so that the house forms correctly. They don’t need to know if the design looks good.",
  "unit1_lesson2_paragraph5": "Architects design the blueprint according to a client's requests. They ensure the plumbing, electricity, and design all work together, and oversee the construction. If something goes wrong (such as incorrect materials being used), they may intervene directly and fix it.",
  "unit1_lesson2_paragraph6": "Now, think of the construction worker as a coder and the architect as a programmer.",
  "unit1_lesson2_paragraph7": "A coder writes code according to a thought-out solution to the problem, and their primary goal is to get the computer to perform specific tasks. For example, if the goal is to write code that finds the sum of two numbers, they tell the computer to add the two numbers, following conventions that the computer understands.",
  "unit1_lesson2_paragraph8": "A programmer, however, has a much bigger responsibility. They not only code but also process problems, design and plan solutions, test them, and fix any errors that occur. Programming is more about problem-solving and ensuring overall functionality rather than translating existing solutions into code. For example, a programmer would design the logic for a calculator application, write the code, test it, and improve its performance.",
  "unit1_lesson2_paragraph9": "In summary, you can think of coding as one instruction in the long recipe called programming. In the following lessons, you’re going to learn about the specifics of each term.",
  "unit1_lesson2_question1": "QUESTION (T/F): Programming and coding have the same meaning.",
  "unit1_lesson2_question1_option1": "True",
  "unit1_lesson2_question1_option2": "False",
  "unit1_lesson2_question1_answer": "Great job!",
  "unit1_lesson2_question1_wrong_answer": "The correct answer is false, but don’t worry. By the end of this lesson, you’ll easily be able to tell programming and coding apart.",
  "unit1_lesson2_question2": "QUESTION (A/B): Make a guess — Who do you think is the construction worker and who do you think is the architect?",
  "unit1_lesson2_question2_option1": "A. The construction workers are the coders and the architects are the programmers.",
  "unit1_lesson2_question2_option2": "B. The construction workers are the programmers and the architects are the coders.",
  "unit1_lesson2_question2_answer": "Good!",
  "unit1_lesson2_question2_wrong_answer": "Nice try! The correct answer is A. The construction workers are the coders and the architects are the programmers. Keep reading to find out why!",
  "unit1_lesson2_question3": "QUESTION (A/B): Select the correct statement.",
  "unit1_lesson2_question3_option1": "A. Programming is a part of coding.",
  "unit1_lesson2_question3_option2": "B. Coding is a part of programming.",
  "unit1_lesson2_question3_answer": "Awesome!",
  "unit1_lesson2_question3_wrong_answer": "So close! The correct answer is B. Coding is a part of programming. Coding is a step in the process of programming, just like how writing the plot is a step in the process of publishing a book.",

  "unit1_lesson3_title": "3. Coding as Part of Programming",
  "unit1_lesson3_info": "1-2 min read · 0 questions",
  "unit1_lesson3_paragraph1": "In the previous lesson, it was mentioned that coding involves instructing the computer in how to solve a problem. But how exactly does the coder tell the computer what to do?  ",
  "unit1_lesson3_paragraph2": "When a coder begins their process, they first have to choose the right language to write the code in. Just as there are different languages in the world — like English, Spanish, and Korean — there are different languages in coding. (You’ll learn more about them when you reach the next station.)",
  "unit1_lesson3_paragraph3": "After they choose a language, they begin translating the solution so that computers can understand. During this process, they have to follow the syntax, or conventions, of the language, much like the ones that humans use.",
  "unit1_lesson3_paragraph4": "Coding is just one part of a bigger idea called programming, where plans are implemented and ideas and designs are turned into actual code. In the next lesson, you’ll learn about the other parts that complete the process of programming!",

  "unit1_lesson4_title": "4. The Programmer’s Workflow",
  "unit1_lesson4_info": "2-3 min read · 2 questions",
  "unit1_lesson4_paragraph1": "In the past two lessons, programming has been emphasized as the broader concept, and you might wonder what else there is to programming if coding isn’t all of it.",
  "unit1_lesson4_paragraph2": "Programming consists of four steps: planning, coding, testing, and debugging.",
  "unit1_lesson4_paragraph3": "Now, you might be picturing the process as something like this:",
  "unit1_lesson4_paragraph4": "In reality, programming is an iterative process, meaning that there isn’t a clear end to it. There are always points for improvement, and the product must constantly be adapted. The process, therefore, can be expressed as something more like this:",
  "unit1_lesson4_paragraph5": "During the “planning” stage of programming, developers create diagrams to visualize their thought process. One way to do this is through a flow chart. In this chart, each action item is connected to each other in an array of choices, and the viewer can follow along the program’s flow by starting from the top.",
  "unit1_lesson4_paragraph6": "During the “coding” stage of programming, developers use the programming language, or type of programming, best suited for the task to simulate the process in the flow chart. This stage often requires a lot of deep thought, as here is where the developer thinks of different logic and methods of creating the program.",
  "unit1_lesson4_paragraph7": "During the “testing” stage of programming, developers have people around them, or sometimes themselves, test out the program that they wrote. This can include intentionally making the program not work properly and trying out all sorts of scenarios to ensure that there are no problems in the future after the solution is published.",
  "unit1_lesson4_paragraph8": "During the “debugging” stage of programming, developers try to fix any problems that they found in the previous stage. Finding the problems in the code, or “bugs,” often takes a long time and is tedious.",
  "unit1_lesson4_question1": "QUESTION (T/F): Programming is a linear process.",
  "unit1_lesson4_question1_option1": "True",
  "unit1_lesson4_question1_option2": "False",
  "unit1_lesson4_question1_answer": "Good job!",
  "unit1_lesson4_question1_wrong_answer": "The correct answer is false! Programming happens in four stages that constantly repeat, making it a cyclic process.",
  "unit1_lesson4_question2": "QUESTION (A/B/C/D): What is the step that often takes the longest?",
  "unit1_lesson4_question2_option1": "A. Planning",
  "unit1_lesson4_question2_option2": "B. Coding",
  "unit1_lesson4_question2_option3": "C. Testing",
  "unit1_lesson4_question2_option4": "D. Debugging",
  "unit1_lesson4_question2_answer": "Awesome!",
  "unit1_lesson4_question2_wrong_answer": "Nice try! The correct answer is D. Debugging. The bigger the project gets, the longer it takes for someone to find a problem, or bug, in it."
}
